app/View/Components/HeaderCategory.php

    public function render(): View|Closure|string
    {
        return view('components.header-category',[
            'categories' => \App\Models\Category::all(),
        ]);
---
select * from `categories`