app/View/Components/Layout.php

    public function render(): View|Closure|string
    {
        $settings = Setting::first();
---
select * from `settings` limit 1