app/Filament/Resources/CategoryResource.php

    public static function getNavigationBadge(): ?string
    {
        return Category::count();
---
select count(*) as aggregate from `categories`