app/Filament/Resources/CommentResource.php

    public static function getNavigationBadge(): ?string
    {
        return Comment::count();
---
select count(*) as aggregate from `comments`