app/Filament/Resources/NewsLetterResource.php

select count(*) as aggregate from `news_letters`
---
    public static function getNavigationBadge(): ?string
    {
        return NewsLetter::count();