app/Filament/Resources/SeoDetailResource.php

    public static function getNavigationBadge(): ?string
    {
        return SeoDetail::count();
---
select count(*) as aggregate from `seo_details`