app/Filament/Resources/ShareSnippetResource.php

    public static function getNavigationBadge(): ?string
    {
        return ShareSnippet::count();
---
select count(*) as aggregate from `share_snippets`