app/Filament/Resources/TagResource.php

    public static function getNavigationBadge(): ?string
    {
        return Tag::count();
---
select count(*) as aggregate from `tags`