app/Filament/Pages/Settings.php

    public function mount(): void
    {
        $this->data = GeneralSetting::first()?->toArray();
---
select * from `general_settings` limit 1